# Імпорт модулю, який використовується для роботи з регулярними виразами (для пошуку та маніпуляції з текстом за допомогою шаблонів).
import re

# Функція generator_numbers, яка знаходить усі числа з плаваючою точкою у тексті.


def generator_numbers(text):
    # Регулярний вираз для ідентифікації чисел з плаваючою точкою
    pattern = r'\b\d+\.\d+\b'
    for match in re.finditer(pattern, text):  # Шукаємо всі відповідності у тексті
        yield float(match.group())  # Повертаємо кожне знайдене число як float


# Функція sum_profit, що обчислює суму чисел з плаваючою точкою, знайдених у тексті.
def sum_profit(text, func):
    # Використовуємо функцію-генератор для підсумовування всіх чисел у тексті
    return sum(func(text))


# Тестовий текстовий рядок демонстрації роботи функцій
text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."
# Викликаємо функцію sum_profit для обрахунку загального доходу
total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income}")  # Виводимо загальний дохід
