def caching_fibonacci():
    # Це словник, який буде використовуватися як кеш для зберігання раніше обчислених значень Фібоначчі
    cache = {}

    def fibonacci(n):
        # Якщо n менше або дорівнює 0, за умовами повертаємо 0
        if n <= 0:
            return 0
        # Якщо n дорівнює 1, за умовами повертаємо 1
        elif n == 1:
            return 1
        # Якщо результат вже є в кеші, просто повертаємо його
        if n in cache:
            return cache[n]

        # Рекурсивно обчислюємо значення Фібоначчі для n-1 і n-2, додаємо їх і зберігаємо у кеші
        cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
        # Повертаємо обчислене значення
        return cache[n]

    # Повертаємо внутрішню функцію, яка може використовуватися для обчислення чисел Фібоначчі
    return fibonacci


# Отримуємо функцію fibonacci
fib = caching_fibonacci()

# Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
print(fib(10))  # Виведе 55
print(fib(15))  # Виведе 610
